; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v2 - type_2 ?v1 - type_1)
 	      (pred_2 ?v3 - object ?v1 - type_1)
	      (pred_3 ?v2 - type_2 ?v7 - type_3)
	      (pred_4 ?v2 - type_2 ?v3 - object ?v7 - type_3))

   (:action op_2
       :parameters  (?v2 - type_2 ?v4 ?v5 - type_1)
       :precondition (and  (pred_1 ?v2 ?v4))
       :effect (and  (pred_1 ?v2 ?v5)
		     (not (pred_1 ?v2 ?v4))))

   (:action op_1
       :parameters (?v2 - type_2 ?v6 - object ?v8 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v8) (pred_1 ?v2 ?v8) (pred_3 ?v2 ?v7))
       :effect (and (pred_4 ?v2 ?v6 ?v7)
		    (not (pred_2 ?v6 ?v8)) 
		    (not (pred_3 ?v2 ?v7))))

   (:action op_3
       :parameters (?v2 - type_2 ?v6 - object ?v8 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_4 ?v2 ?v6 ?v7) (pred_1 ?v2 ?v8))
       :effect (and (pred_2 ?v6 ?v8)
		    (pred_3 ?v2 ?v7)
		    (not (pred_4 ?v2 ?v6 ?v7)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_01 obj_07 - type_2
obj_05 obj_06 obj_08 obj_03 - type_3
obj_02 obj_11 obj_09 - type_1
obj_04 obj_12 obj_10 - object)
(:init
(pred_1 obj_01 obj_02)
(pred_3 obj_01 obj_05)
(pred_3 obj_01 obj_06)
(pred_1 obj_07 obj_11)
(pred_3 obj_07 obj_08)
(pred_3 obj_07 obj_03)
(pred_2 obj_04 obj_02)
(pred_2 obj_12 obj_02)
(pred_2 obj_10 obj_09)
)
(:goal
(and
(pred_2 obj_04 obj_02)
(pred_2 obj_12 obj_09)
(pred_2 obj_10 obj_11)
)
)

(:constraints
  (always (not (pred_1 obj_01 obj_09)))
)
)

; plan
1. (op_1 obj_01 obj_12 obj_02 obj_06)
   deleted: (pred_2 obj_12 obj_02) (pred_3 obj_01 obj_06)
   added: (pred_4 obj_01 obj_12 obj_06)
   goals met: 1 of 3
2. (op_2 obj_07 obj_11 obj_09)
   deleted: (pred_1 obj_07 obj_11)
   added: (pred_1 obj_07 obj_09)
   goals met: 1 of 3
3. (op_1 obj_07 obj_10 obj_09 obj_03)
   deleted: (pred_2 obj_10 obj_09) (pred_3 obj_07 obj_03)
   added: (pred_4 obj_07 obj_10 obj_03)
   goals met: 1 of 3
4. (op_2 obj_01 obj_02 obj_11)
   deleted: (pred_1 obj_01 obj_02)
   added: (pred_1 obj_01 obj_11)
   goals met: 1 of 3
5. (op_2 obj_07 obj_09 obj_11)
   deleted: (pred_1 obj_07 obj_09)
   added: (pred_1 obj_07 obj_11)
   goals met: 1 of 3
6. (op_3 obj_01 obj_12 obj_11 obj_06)
   deleted: (pred_4 obj_01 obj_12 obj_06)
   added: (pred_2 obj_12 obj_11) (pred_3 obj_01 obj_06)
   goals met: 1 of 3
7. (op_3 obj_07 obj_10 obj_11 obj_03)
   deleted: (pred_4 obj_07 obj_10 obj_03)
   added: (pred_2 obj_10 obj_11) (pred_3 obj_07 obj_03)
   goals met: 2 of 3
8. (op_1 obj_07 obj_12 obj_11 obj_03)
   deleted: (pred_2 obj_12 obj_11) (pred_3 obj_07 obj_03)
   added: (pred_4 obj_07 obj_12 obj_03)
   goals met: 2 of 3
9. (op_2 obj_07 obj_11 obj_09)
   deleted: (pred_1 obj_07 obj_11)
   added: (pred_1 obj_07 obj_09)
   goals met: 2 of 3
10. (op_3 obj_07 obj_12 obj_09 obj_03)
   deleted: (pred_4 obj_07 obj_12 obj_03)
   added: (pred_2 obj_12 obj_09) (pred_3 obj_07 obj_03)
   goals met: 3 of 3
